{"format": "graph-model", "generatedBy": "2.15.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}}, "outputs": {"layer_from_saved_model": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/add/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/aspp/conv1_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1280"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/aspp/conv1_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/aspp/conv1_2/required_space_to_batch_paddings/strided_slice_2/_3__cf__3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/aspp/conv1_2/required_space_to_batch_paddings/strided_slice_4/_4__cf__4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/aspp/conv1_2/required_space_to_batch_paddings/strided_slice_1/_2__cf__2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/aspp/conv1_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1280"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/aspp/conv1_2/required_space_to_batch_paddings/add", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/aspp/conv1_2/dilation_rate", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/aspp/conv1_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/aspp/conv1_3/required_space_to_batch_paddings/strided_slice_2/_7__cf__7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/aspp/conv1_3/required_space_to_batch_paddings/strided_slice_4/_8__cf__8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/aspp/conv1_3/required_space_to_batch_paddings/strided_slice_1/_6__cf__6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/aspp/conv1_3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1280"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/aspp/conv1_3/required_space_to_batch_paddings/add", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/aspp/conv1_3/dilation_rate", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/aspp/conv1_3/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/aspp/conv1_4/required_space_to_batch_paddings/strided_slice_2/_11__cf__11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/aspp/conv1_4/required_space_to_batch_paddings/strided_slice_4/_12__cf__12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/aspp/conv1_4/required_space_to_batch_paddings/strided_slice_1/_10__cf__10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/aspp/conv1_4/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1280"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/aspp/conv1_4/required_space_to_batch_paddings/add", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/aspp/conv1_4/dilation_rate", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/aspp/conv1_4/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/aspp/conv1_5/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1280"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/aspp/conv1_5/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_3/required_space_to_batch_paddings/strided_slice_2/_16__cf__16", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_2/required_space_to_batch_paddings/strided_slice_4/_15__cf__15", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/strided_slice_1/_14__cf__14", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/crops/0/0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/Reshape/_0__cf__0", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv1/conv1_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv1/conv1_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv1/conv1_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv1/conv1_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv2/conv2_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv2/conv2_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv2/conv2_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv2/conv2_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv3/conv3_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv3/conv3_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv3/conv3_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv3/conv3_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv3/conv3_3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv3/conv3_3/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv4/conv4_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv4/conv4_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv4/conv4_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv4/conv4_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv4/conv4_3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv4/conv4_3/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/add", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_2/required_space_to_batch_paddings/add", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_3/required_space_to_batch_paddings/add", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/dilation_rate", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_3/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/aspp/conv2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1280"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/aspp/conv2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/decoder/conv1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/decoder/conv1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/decoder/conv2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/decoder/conv2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/mul_2/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/decoder/conv3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/decoder/conv3/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/decoder/conv4/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/decoder/conv4/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/Min/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/sub", "op": "Sub", "input": ["input_1", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/Reshape/_0__cf__0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv1/conv1_1/Relu", "op": "_FusedConv2D", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/sub", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv1/conv1_1/kernel", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv1/conv1_1/bias"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-15"}, {"size": "-16"}, {"size": "-17"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "64"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv1/conv1_2/Relu", "op": "_FusedConv2D", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv1/conv1_1/Relu", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv1/conv1_2/kernel", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv1/conv1_2/bias"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-15"}, {"size": "-16"}, {"size": "64"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "64"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/max_pooling2d/MaxPool", "op": "MaxPool", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv1/conv1_2/Relu"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv2/conv2_1/Relu", "op": "_FusedConv2D", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/max_pooling2d/MaxPool", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv2/conv2_1/kernel", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv2/conv2_1/bias"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-18"}, {"size": "-19"}, {"size": "64"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv2/conv2_2/Relu", "op": "_FusedConv2D", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv2/conv2_1/Relu", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv2/conv2_2/kernel", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv2/conv2_2/bias"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-18"}, {"size": "-19"}, {"size": "128"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/max_pooling2d_1/MaxPool", "op": "MaxPool", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv2/conv2_2/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv3/conv3_1/Relu", "op": "_FusedConv2D", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/max_pooling2d_1/MaxPool", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv3/conv3_1/kernel", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv3/conv3_1/bias"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-20"}, {"size": "-21"}, {"size": "128"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv3/conv3_2/Relu", "op": "_FusedConv2D", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv3/conv3_1/Relu", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv3/conv3_2/kernel", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv3/conv3_2/bias"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-20"}, {"size": "-21"}, {"size": "256"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv3/conv3_3/Relu", "op": "_FusedConv2D", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv3/conv3_2/Relu", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv3/conv3_3/kernel", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv3/conv3_3/bias"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-20"}, {"size": "-21"}, {"size": "256"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/max_pooling2d_2/MaxPool", "op": "MaxPool", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv3/conv3_3/Relu"], "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv4/conv4_1/Relu", "op": "_FusedConv2D", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/max_pooling2d_2/MaxPool", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv4/conv4_1/kernel", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv4/conv4_1/bias"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-4"}, {"size": "-4"}, {"size": "256"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "512"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv4/conv4_2/Relu", "op": "_FusedConv2D", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv4/conv4_1/Relu", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv4/conv4_2/kernel", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv4/conv4_2/bias"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-4"}, {"size": "-4"}, {"size": "512"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}]}}, "filter_format": {"s": "SFdJTw=="}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv4/conv4_3/Relu", "op": "_FusedConv2D", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv4/conv4_2/Relu", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv4/conv4_3/kernel", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv4/conv4_3/bias"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-4"}, {"size": "-4"}, {"size": "512"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/max_pooling2d_3/MaxPool", "op": "MaxPool", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv4/conv4_3/Relu"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/Shape", "op": "Shape", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/max_pooling2d_3/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/Shape", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/strided_slice/stack", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/strided_slice/stack_1", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/strided_slice/stack"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/strided_slice_1", "op": "StridedSlice", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/Shape", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/strided_slice/stack_1", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/strided_slice_1/stack_1", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/strided_slice/stack"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/stack_1", "op": "Pack", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/strided_slice", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/strided_slice_1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/add_1", "op": "Add", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/stack_1", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/add"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/mod", "op": "FloorMod", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/add_1", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/dilation_rate"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/sub", "op": "Sub", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/dilation_rate", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/mod"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/mod_1", "op": "FloorMod", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/sub", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/dilation_rate"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/add_2", "op": "Add", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/strided_slice_1/_14__cf__14", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/mod_1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/strided_slice_6", "op": "StridedSlice", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/mod_1", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/strided_slice_2/stack", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/strided_slice/stack", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/strided_slice/stack"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/strided_slice_7", "op": "StridedSlice", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/mod_1", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/strided_slice/stack", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/strided_slice/stack_1", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/strided_slice/stack"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/strided_slice_3", "op": "StridedSlice", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/add_2", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/strided_slice_2/stack", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/strided_slice/stack", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/strided_slice/stack"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/strided_slice_5", "op": "StridedSlice", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/add_2", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/strided_slice/stack", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/strided_slice/stack_1", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/strided_slice/stack"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/crops/0", "op": "Pack", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/crops/0/0", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/strided_slice_6"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/crops/1", "op": "Pack", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/crops/0/0", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/strided_slice_7"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/paddings/0", "op": "Pack", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_3/required_space_to_batch_paddings/strided_slice_2/_16__cf__16", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/strided_slice_3"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/paddings/1", "op": "Pack", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_2/required_space_to_batch_paddings/strided_slice_4/_15__cf__15", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/strided_slice_5"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/crops", "op": "Pack", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/crops/0", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/crops/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/paddings", "op": "Pack", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/paddings/0", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/paddings/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/SpaceToBatchND", "op": "SpaceToBatchND", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/max_pooling2d_3/MaxPool", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/dilation_rate", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/paddings"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "Tblock_shape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/Conv2D", "op": "Conv2D", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/SpaceToBatchND", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/kernel"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-22"}, {"size": "-23"}, {"size": "-23"}, {"size": "512"}]}, {"dim": [{"size": "3"}, {"size": "3"}, {"size": "512"}, {"size": "512"}]}]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/BatchToSpaceND", "op": "BatchToSpaceND", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/Conv2D", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/dilation_rate", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/required_space_to_batch_paddings/crops"], "attr": {"Tblock_shape": {"type": "DT_INT32"}, "Tcrops": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/BiasAdd", "op": "BiasAdd", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/BatchToSpaceND", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-26"}, {"size": "-27"}, {"size": "-27"}, {"size": "512"}]}, {"dim": [{"size": "512"}]}]}}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/Relu", "op": "Relu", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_2/Shape", "op": "Shape", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_2/strided_slice", "op": "StridedSlice", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_2/Shape", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/strided_slice/stack", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/strided_slice/stack_1", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/strided_slice/stack"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_2/strided_slice_1", "op": "StridedSlice", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_2/Shape", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/strided_slice/stack_1", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/strided_slice_1/stack_1", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_1/strided_slice/stack"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_2/stack_1", "op": "Pack", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_2/strided_slice", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_2/strided_slice_1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_2/required_space_to_batch_paddings/add_1", "op": "Add", "input": ["PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_2/stack_1", "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_2/required_space_to_batch_paddings/add"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model/layer_from_saved_model/PartitionedCall/conv5/conv5_2/required_space_to_batch_paddings/mod", "op": "FloorMod", 